{
	"Title": "Escape UCSC",
	"Credits": "Created by Justin Lam",
	"InitialLocation": "Intro",
	"Locations": {
		"Intro": {
			"Body": "A horrible virus that turns people into banana slugs has recently been discovered at UCSC. In order to prevent it from spreading, the United States government has mandated that the school be put on quarantine until a cure has been found. \"I can't just sit around here and become a banana slug while waiting that, I need to get out of here!\" you tell yourself.",
			"Choices": [
				{
					"Text": "Start Game",
					"Target": "Cowell"
				}
			]
		},
		"Cowell": {
			"Body": "Welcome to Cowell college. The view of the ocean is breathtaking but it feels bad knowing it's impossible to go there at the moment.",
			"Choices": [
				{
					"Text": "West",
					"Target": "Crown"
				},
				{
					"Text": "East",
					"Target": "EastGate"
				}
			]
		},
		"EastGate": {
			"Body": "You stand before UCSC's East Gate. There's a lot of police and barricades here preventing you from going any further. A person in a hazmat suit tells you to leave.",
			"Choices": [
				{
					"Text": "West",
					"Target": "Cowell"
				}
			]
		},
		"Crown": {
			"Body": "After trekking up for what seems like forever you finally find yourself at Crown college. There's a water fountain here that you have never seen working.",
			"Choices": [
				{
					"Text": "West",
					"Target": "JRL"
				},
				{
					"Text": "East",
					"Target": "Cowell"
				}
			]
		},
		"JRL": {
			"Body": "Ah, John R. Lewis College, home to many of UCSC's most recent constructions. You admire the colorful buildings here.",
			"Choices": [
				{
					"Text": "West",
					"Target": "ScienceHill",
					"IsSpecial": true
				},
				{
					"Text": "East",
					"Target": "Crown"
				}
			]
		},
		"ScienceHill": {
			"Bodies":
			[
				"You're now at Science Hill, once one of the most busiest places on campus but now a ghost town after the quarter was halted.",
				"You're now at Science Hill, once one of the most busiest places on campus but now a ghost town after the quarter was halted. There's a labcoat, scientist's keycard, and a banana slug all on the ground next to each other. You recognize the scientist pictured on the keycard to be the one who ran past you earlier at Kresge.",
				"You're now at Science Hill, once one of the most busiest places on campus but now a ghost town after the quarter was halted. There's a labcoat and a banana slug on the ground next to each other."
			],
			"Choices": [
				{
					"Text": "West",
					"Target": "Kresge",
					"IsSpecial": true
				},
				{
					"Text": "East",
					"Target": "JRL"
				},
				{
					"Text": "Pickup keycard",
					"Response": "You picked up the keycard."
				}
			]
		},
		"Kresge": {
			"Bodies":
			[
				"A scientist hurriedly brushes past you as you enter Kresge college. They've converted the new academic building here into a lab for the virus that only scientists can enter. Next to the doors to the lab is a keycard scanner.",
				"You enter Kresge college. They've converted the new academic building here into a lab for the virus that only scientists can enter. Next to the doors to the lab is a keycard scanner."
			],
			"Choices": [
				{
					"Text": "West",
					"Target": "Oakes"
				},
				{
					"Text": "East",
					"Target": "ScienceHill",
					"IsSpecial": true
				},
				{
					"Text": "Scan keycard",
					"SuccessResponse": "You hold the recently slug-ceased scientist's keycard up to the scanner. The double doors to the lab swing open.",
					"FailureResponse": "You hold your student ID up to the scanner. Nothing happens."
				},
				{
					"Hidden": true,
					"Text": "Lab",
					"Target": "Helipad"
				}
			]
		},
		"Helipad": {
			"Body": "You enter the lab and make your way upstairs to the helipad. There, parked perfectly on the big 'H' lies your freedom.",
			"Choices": [
				{
					"Text": "Hijack helicopter",
					"Target": "Helicopter"
				},
				{
					"Text": "Return",
					"Target": "Kresge",
					"IsSpecial": true
				}
			]
		},
		"Helicopter": {
			"Body": "You ascend, finally escaping the earthly restraints of your prison. Gazing at the shrinking trees down below, you smile."
		},
		"Oakes": {
			"Body": "Furthest away from where you've began your journey is Oakes college. The brown, cubic architecture here reminds you of the first house you made in Minecraft.",
			"Choices": [
				{
					"Text": "West",
					"Target": "WestGate"
				},
				{
					"Text": "East",
					"Target": "Kresge",
					"IsSpecial": true
				}
			]
		},
		"WestGate": {
			"Body": "You stand before UCSC's West Gate. There's a lot of police and barricades here preventing you from going any further. A policeman up ahead notices you and instructs you to turn around.",
			"Choices": [
				{
					"Text": "East",
					"Target": "Oakes"
				}
			]
		}
	}
}